#!/bin/sh

if [ ! -n "$1" ]
then
echo "Использование: $0"
echo "Введите хотя бы одно слово"
exit 1
fi

for var in "$@"
do
if [[ $var == *"ая" ]] || [[ $var == *"яя" ]] || [[ $var == *"ой" ]] || [[ $var == *"ей" ]] || [[ $var == *"ую" ]] || [[ $var == *"юю" ]] || [[ $var == *"ой" ]]; then
echo "$var - прилагательное."
elif [[ $var == *"ый" ]] || [[ $var == *"ий" ]] || [[ $var == *"ого" ]] || [[ $var == *"его" ]] || [[ $var == *"ому" ]] || [[ $var == *"ему" ]] || [[ $var == *"ым" ]]; then
echo "$var - прилагательное."
elif [[ $var == *"им" ]] || [[ $var == *"ом" ]] || [[ $var == *"ем" ]] || [[ $var == *"ое" ]] || [[ $var == *"ее" ]] || [[ $var == *"ые" ]] || [[ $var == *"ие" ]]; then
echo "$var - прилагательное."
elif [[ $var == *"их" ]] || [[ $var == *"ых" ]] || [[ $var == *"ым" ]] || [[ $var == *"им" ]] || [[ $var == *"ых" ]] || [[ $var == *"их" ]] || [[ $var == *"ыми" ]] || [[ $var == *"ими" ]]; then
echo "$var - прилагательное."
elif [[ $var == *"у" ]] || [[ $var == *"ю" ]] || [[ $var == *"ешь" ]] || [[ $var == *"ем" ]] || [[ $var == *"ете" ]] || [[ $var == *"ет" ]] || [[ $var == *"ут" ]] || [[ $var == *"ют" ]] || [[ $var == *"ть" ]]; then
echo "$var - глагол."
elif [[ $var == *"им" ]] || [[ $var == *"ишь" ]] || [[ $var == *"ите" ]] || [[ $var == *"и" ]] || [[ $var == *"ат" ]] || [[ $var == *"ят" ]] || [[ $var == *"еть" ]] || [[ $var == *"ить" ]] || [[ $var == *"ать" ]] || [[ $var == *"ла" ]] || [[ $var == *"ло" ]] || [[ $var == *"ли" ]] || [[ $var == *"ил" ]] || [[ $var == *"ел" ]]; then
echo "$var - глагол."
elif [[ $var == *"а" ]] || [[ $var == *"я" ]] || [[ $var == *"о" ]] || [[ $var == *"е" ]] || [[ $var == *"ы" ]] || [[ $var == *"и" ]] || [[ $var == *"и" ]] || [[ $var == *"е" ]] || [[ $var == *"б" ]]; then
echo "$var - существительное."
else 
echo "$var - не имеет определенного способа определения."
fi
done